Synwit-Co-Ltd/SWM220/SWM220_Lib/SWM220_StdPeriph_Driver/CSL/SWM220_StdPeriph_Driver/SWM220_can.c
	if(msg->format == CAN_FRAME_STD)
	{
		msg->id = (CANx->RXFRAME.DATA[0] << 3) | (CANx->RXFRAME.DATA[1] >> 5);
		
		for(i = 0; i < msg->size; i++)
		{
			msg->data[i] = CANx->RXFRAME.DATA[i+2];
		}
	}
	else //if(msg->format == CAN_FRAME_EXT)
	{
		msg->id = (CANx->RXFRAME.DATA[0] << 21) | (CANx->RXFRAME.DATA[1] << 13) | (CANx->RXFRAME.DATA[2] << 5) | (CANx->RXFRAME.DATA[3] >> 3);
		
		for(i = 0; i < msg->size; i++)
		{
			msg->data[i] = CANx->RXFRAME.DATA[i+4];
		}
	}
	
	CANx->CMD = (1 << CAN_CMD_RRB_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_TXComplete()
* 功能说明:	发送是否完成
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t			1 已经完成    0 还未完成
* 注意事项: 发送被Abort也会触发发送完成，但不会触发发送成功
******************************************************************************************************************************************/
uint32_t CAN_TXComplete(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXBR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_TXSuccess()
* 功能说明:	发送是否成功
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t			1 发送成功    0 发送失败
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_TXSuccess(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXOK_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_AbortTransmit()
* 功能说明:	终止发送
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 正在进行的发送无法终止，但执行此命令后若发送失败不会再重发
******************************************************************************************************************************************/
void CAN_AbortTransmit(CAN_TypeDef * CANx)
{
	CANx->CMD = (1 << CAN_CMD_ABTTX_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_TXBufferReady()
* 功能说明:	TX Buffer是否准备好可以写入消息
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t			1 已准备好    0 未准备好
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_TXBufferReady(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXBR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_RXDataAvailable()
* 功能说明:	RX FIFO中是否有数据可读出
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t			1 有数据可读出    0 没有数据
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_RXDataAvailable(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_RXDA_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_SetBaudrate()
* 功能说明:	设置波特率
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			uint32_t baudrate	波特率，即位传输速率
*			uint32_t CAN_BS1	CAN_BS1_1tq、CAN_BS1_2tq、... ... 、CAN_BS1_16tq
*			uint32_t CAN_BS2	CAN_BS2_1tq、CAN_BS2_2tq、... ... 、CAN_BS2_8tq
*			uint32_t CAN_SJW	CAN_SJW_1tq、CAN_SJW_2tq、CAN_SJW_3tq、CAN_SJW_4tq
* 输    出: 无
* 注意事项: 设置前需要先调用CAN_Close()关闭CAN模块
******************************************************************************************************************************************/
void CAN_SetBaudrate(CAN_TypeDef * CANx, uint32_t baudrate, uint32_t CAN_BS1, uint32_t CAN_BS2, uint32_t CAN_SJW)
{
	CANx->BT1 = (0 << CAN_BT1_SAM_Pos) |
				(CAN_BS1 << CAN_BT1_TSEG1_Pos) |
				(CAN_BS2 << CAN_BT1_TSEG2_Pos);
	
	CANx->BT0 = (CAN_SJW << CAN_BT0_SJW_Pos) |
				((SystemCoreClock/2/baudrate/(1 + (CAN_BS1 + 1) + (CAN_BS2 + 1)) - 1) << CAN_BT0_BRP_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_SetFilter32b()
* 功能说明:	设置接收滤波器，1个32位滤波器
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			uint32_t check		与mask一起决定了接收到的Message是否是自己需要的：check & (~mask) == ID & (~mask)的Message通过过滤
*			uint32_t mask
* 输    出: 无
* 注意事项: 设置前需要先调用CAN_Close()关闭CAN模块
******************************************************************************************************************************************/
void CAN_SetFilter32b(CAN_TypeDef * CANx, uint32_t check, uint32_t mask)
{
	CANx->CR &= ~CAN_CR_AFM_Msk;
	CANx->CR |= (CAN_FILTER_32b << CAN_CR_AFM_Pos);
	
	CANx->FILTER.AMR[3] =  mask & 0xFF;
	CANx->FILTER.AMR[2] = (mask >>  8) & 0xFF;
	CANx->FILTER.AMR[1] = (mask >> 16) & 0xFF;
	CANx->FILTER.AMR[0] = (mask >> 24) & 0xFF;
	
	CANx->FILTER.ACR[3] =  check & 0xFF;
	CANx->FILTER.ACR[2] = (check >>  8) & 0xFF;
	CANx->FILTER.ACR[1] = (check >> 16) & 0xFF;
	CANx->FILTER.ACR[0] = (check >> 24) & 0xFF;
}

/****************************************************************************************************************************************** 
* 函数名称:	CAN_SetFilter16b()
* 功能说明:	设置接收滤波器，2个16位滤波器
* 输    入: CAN_TypeDef * CANx	指定要被设置的CAN接口，有效值包括CAN
*			uint16_t check1		与mask一起决定了接收到的Message是否是自己需要的：check & (~mask) == ID & (~mask)的Message通过过滤
*			uint16_t mask1
*			uint16_t check2
*			uint16_t mask2
* 输    出: 无
* 注意事项: 设置前需要先调用CAN_Close()关闭CAN模块
******************************************************************************************************************************************/
void CAN_SetFilter16b(CAN_TypeDef * CANx, uint16_t check1, uint16_t mask1, uint16_t check2, uint16_t mask2)
{
	CANx->CR &= ~CAN_CR_AFM_Msk;
	CANx->CR |= (CAN_FILTER_16b << CAN_CR_AFM_Pos);
	
	CANx->FILTER.AMR[3] =  mask1 & 0xFF;
	CANx->FILTER.AMR[2] = (mask1 >>  8) & 0xFF;
	CANx->FILTER.AMR[1] =  mask2 & 0xFF;
	CANx->FILTER.AMR[0] = (mask2 >>  8) & 0xFF;
	
